GeoPINS/2-D_Navier-Stokes_equation_on_irregular_river_channels/dataset/0/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
3773
(
(0.00162211 0.00258867 0)
(0.000940551 0.00778423 2.58671e-19)
(0.000535287 0.0130095 8.37261e-20)
(0.000340569 0.0182477 -8.34365e-20)
(0.000284834 0.0234897 0)
(0.000308081 0.0287321 0)
(0.000344844 0.0339745 5.1486e-19)
(0.000359853 0.0392167 0)
...
)
;

boundaryField
{
    low
    {
        type            calculated;
        value           nonuniform List<vector> 
49
(
(0.00204082 0 0)
(0.00612245 0 0)
(0.0102041 0 0)
(0.0142857 0 0)
(0.0183673 0 0)
(0.022449 0 0)
(0.0265306 0 0)
(0.0306122 0 0)
...
)
;
    }
    left
    {
        type            calculated;
        value           nonuniform List<vector> 
77
(
(-0.000420206 0.00259241 0)
(-0.00110699 0.0077975 0)
(-0.00151661 0.0130325 0)
(-0.00171533 0.0182805 0)
(-0.0017752 0.0235324 0)
(-0.00175664 0.0287848 0)
(-0.00172551 0.0340372 0)
(-0.00171715 0.0392897 0)
...
)
;
    }
    rifht
    {
        type            calculated;
        value           nonuniform List<vector> 
77
(
(0.199865 0.00211145 0)
(0.199696 0.00633839 0)
(0.199721 0.0105688 0)
(0.199922 0.0147947 0)
(0.200276 0.0190109 0)
(0.200763 0.0232138 0)
(0.201357 0.0274032 0)
(0.202027 0.0315813 0)
...
)
;
    }
    up
    {
        type            calculated;
        value           nonuniform List<vector> 
49
(
(0.0274632 0.370685 0)
(0.0322367 0.369298 0)
(0.0370102 0.36791 0)
(0.0417837 0.366523 0)
(0.0465573 0.365135 0)
(0.0513309 0.363748 0)
(0.0561044 0.362361 0)
(0.0608741 0.36096 0)
...
)
;
    }
    frontAndBackPlanes
    {
        type            empty;
    }
}


// ************************************************************************* //
